# frozen_string_literal: true

# https://github.com/Homebrew/homebrew-bundle
tap "aws/tap"
tap "bramstein/fonttools"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "isen-ng/dotnet-sdk-versions"
tap "mas-cli/tap"
tap "puma/puma"
tap "rodionovd/taps"
tap "stripe/stripe-cli"
tap "universal-ctags/universal-ctags"


# Homebrew
# https://github.com/Homebrew/brew/

# Need to install openssl before libyaml
brew "openssl"
brew "openssl@1.1" # wget dependency

brew "advancecomp"
brew "ansible"
brew "asciidoctor"
brew "autoconf" # asdf dependency
brew "automake" # asdf dependency
brew "awscli"
brew "azure-cli"
brew "bash"
brew "bash-completion"
brew "bat"
brew "blueutil"
brew "bramstein/fonttools/woff2"
brew "cloc"
brew "cmake"
brew "coreutils"
brew "curl"
brew "diff-so-fancy"
brew "dos2unix"
brew "exa"
brew "fd"
brew "fish"
brew "fontforge"
brew "fonttools"
brew "fzf"
brew "gifsicle"
brew "git"
brew "git-quick-stats"
brew "gnupg"
brew "bfg"
brew "openjdk"
brew "gmp" # Vim dependency
brew "gnupg" # asdf-nodejs dependency
brew "highlight"
brew "htop"
brew "httpie"
brew "imagemagick"
brew "imapsync"
brew "istioctl"
brew "jhead"
brew "jq"
brew "kamel"
brew "less"
brew "libtermkey"
brew "libtool" # asdf dependency
brew "libxslt" # asdf dependency
brew "libyaml" # asdf dependency
brew "mackup"
brew "mas"
brew "media-info"
brew "memcached"
brew "minikube"
brew "most"
brew "multitail"
brew "neofetch"
brew "neovim", args: ["HEAD"]
brew "nmap"
brew "ocrmypdf"
brew "onefetch"
brew "overmind"
brew "pandoc"
brew "python"
brew "p7zip"
brew "ranger"
brew "readline"
brew "redis"
brew "ripgrep"
brew "rlwrap"
brew "rsync"
brew "screen"
brew "shellcheck"
brew "sqlite"
brew "ssh-copy-id"
brew "speedtest-cli"
brew "starship"
brew "stripe/stripe-cli/stripe"
brew "ssh-copy-id"
brew "tesseract-lang"
brew "the_silver_searcher"
brew "tldr"
brew "topgrade"
brew "tmux"
brew "trash"
brew "tree"
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
#brew "w3m"
brew "wget"
brew "xz"
brew "yarn"
brew "ykpers"
brew "youtube-dl"
brew "zsh"

# homebrew-cask
# https://github.com/caskroom/homebrew-cask

cask "1password"
cask "aerial"
cask "arq"
cask "audio-hijack"
cask "cheatsheet"
cask "cyberduck"
cask "daisydisk"
cask "devonthink"
cask "dropbox"
cask "elgato-stream-deck"
cask "elgato-control-center"
cask "flutter"
cask "font-caskaydia-cove-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-victor-mono-nerd-font"
cask "fujitsu-scansnap-manager"
cask "franz"
cask "hazel"
cask "istat-menus"
cask "iterm2-beta"
cask "jabra-direct"
cask "keka"
cask "little-snitch"
cask "logitech-options"
cask "logitech-camera-settings"
cask "microsoft-edge"
cask "microsoft-office"
cask "microsoft-teams"
cask "moneymoney"
cask "mullvadvpn"
cask "obs"
cask "onedrive"
cask "parallels-desktop"
cask "postman"
cask "pocket-casts"
cask "receipts"
cask "screenflick"
cask "setapp"
cask "signal"
cask "skype"
cask "slack"
cask "soundsource"
cask "sonos"
cask "superduper"
cask "the-unarchiver"
cask "visual-studio-code"
cask "whatsapp"
cask "workflowy"
cask "wireshark"
cask "zoom"
cask "zoomus"
mas "AusweisApp2", id: 948660805
mas "Disk Diet", id: 445512770
mas "DuckDuckGo Privacy Essentials", id: 1482920575
mas "Duplicates Cleaner", id: 1012324495
mas "HP Smart", id: 1474276998
mas "Microsoft To Do", id: 1274495053
mas "Motif", id: 1404636482
mas "OmniGraffle", id: 1142578753
mas "Pages", id: 409201541
mas "ReadKit", id: 588726889
mas "Things", id: 904280696
mas "ToothFairy", id: 1191449274
mas "WHITEWALL", id: 1286836110
mas "Xcode", id: 497799835
