# frozen_string_literal: true

# https://github.com/Homebrew/homebrew-bundle
tap "aws/tap"
tap "bramstein/fonttools"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "puma/puma"
tap "universal-ctags/universal-ctags"
tap "mas-cli/tap"

# Homebrew
# https://github.com/Homebrew/brew/

# Need to install openssl before libyaml
brew "openssl"
brew "openssl@1.1" # wget dependency

brew "advancecomp"
brew "ansible"
brew "asciidoctor"
brew "autoconf" # asdf dependency
brew "automake" # asdf dependency
brew "awscli"
brew "bash"
brew "bash-completion"
brew "bat"
brew "bramstein/fonttools/woff2"
brew "cloc"
brew "cmake"
brew "coreutils"
brew "curl"
brew "diff-so-fancy"
brew "dos2unix"
brew "exa"
brew "fish"
brew "fontforge"
brew "fzf"
brew "gifsicle"
brew "git"
brew "git-quick-stats"
brew "gmp" # Vim dependency
brew "gnupg" # asdf-nodejs dependency
brew "highlight"
brew "htop"
brew "httpie"
brew "imagemagick"
brew "jhead"
brew "jq"
brew "less"
brew "libtermkey"
brew "libtool" # asdf dependency
brew "libxslt" # asdf dependency
brew "libyaml" # asdf dependency
brew "mas"
brew "media-info"
brew "memcached"
brew "mono"
brew "most"
brew "multitail"
brew "neofetch"
brew "neovim", args: ["HEAD"]
brew "onefetch"
brew "overmind"
brew "pandoc"
#brew "perl"
#brew "pgcli"
#brew "postgresql", restart_service: true
#brew "puma/puma/puma-dev"
brew "python"
brew "ranger"
brew "readline"
brew "ripgrep"
brew "rlwrap"
brew "rsync"
brew "screen"
brew "shellcheck"
brew "sqlite"
brew "ssh-copy-id"
brew "speedtest-cli"
brew "starship"
brew "the_silver_searcher"
brew "tldr"
brew "tmux"
brew "trash"
brew "tree"
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
#brew "unixodbc" # asdf dependency
#brew "w3m"
brew "wget"
brew "xz"
brew "yarn"
brew "youtube-dl"
brew "zsh"

# homebrew-cask
# https://github.com/caskroom/homebrew-cask

cask "1password"
#cask "alfred"
cask "aerial"
cask "airfoil"
cask "arq"
cask "audio-hijack"
#cask "beersmith2"
#cask "balenaetcher"
#cask "bartender"
#cask "brave-browser"
#cask "carbon-copy-cloner"
cask "cheatsheet"
cask "cleanmymac"
#cask "clover-configurator"
cask "cyberduck"
cask "daisydisk"
#cask "dash"
cask "devonthink-pro-office"
cask "dropbox"
cask "duet"
cask "elgato-stream-deck"
cask "font-caskaydia-cove-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-jetbrainsmono-nerd-font"
cask "font-victormono-nerd-font"
cask "franz"
cask "google-chrome"
cask "google-cloud-sdk"
#cask "handbrake"
cask "hazel"
cask "istat-menus"
cask "iterm2"
cask "keka"
cask "little-snitch"
cask "micro-snitch"
cask "microsoft-edge"
cask "microsoft-excel"
cask "microsoft-word"
cask "microsoft-outlook"
cask "microsoft-powerpoint"
cask "microsoft-teams"
cask "moneymoney"
cask "obs"
cask "obs-virtualcam"
cask "onedrive"
cask "parallels-desktop"
cask "pdftotext"
cask "pgadmin4"
cask "postico"
cask "postman"
#cask "send-to-kindle"
cask "screenflick"
cask "signal"
cask "skype"
cask "slack"
cask "soundflower"
cask "steam"
cask "superduper"
cask "virtualbox"
cask "whatsapp"
cask "workflowy"
cask "wireshark"
cask "zoomus"

# rubocop:disable Style/NumericLiterals
mas "Deliveries", id: 924726344
mas "Magnet", id: 441258766
mas "Motif", id: 1404636482
mas "OmniGraffle", id: 1142578753
mas "Pages", id: 409201541
mas "ReadKit", id: 588726889
mas "Spark", id: 1176895641
mas "Things 3", id: 904280696
mas "ToothFairy", id: 1191449274
mas "WHITEWALL", id: 1286836110
#mas "Xcode", id: 497799835
