tap "aws/tap"
tap "bramstein/fonttools"
tap "confluentinc/confluent-hub-client"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "isen-ng/dotnet-sdk-versions"
tap "mas-cli/tap"
brew "awscli"
brew "python@3.8"
brew "azure-cli"
brew "bash"
brew "bash-completion"
brew "openjdk"
brew "bfg"
brew "binutils", link: true
brew "p7zip"
brew "ssdeep"
brew "binwalk"
brew "blueutil"
brew "cf"
brew "cifer"
brew "cmake"
brew "concurrencykit"
brew "coreutils"
brew "curl"
brew "dex2jar"
brew "dns2tcp"
brew "docker-machine-driver-xhyve"
brew "dyld-headers"
brew "libtool"
brew "tesseract"
brew "x264"
brew "ffmpeg"
brew "fish"
brew "foremost"
brew "mpfr"
brew "gcc"
brew "gh"
brew "git"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "grep"
brew "hashpump"
brew "helm"
brew "hopenpgp-tools"
brew "imagemagick"
brew "imapsync"
brew "istioctl"
brew "john"
brew "jq"
brew "kubernetes-cli"
brew "libidn"
brew "lynx"
brew "mackup"
brew "mas"
brew "maven"
brew "mbedtls"
brew "minikube"
brew "moreutils"
brew "mysql-client"
brew "narwhal"
brew "neovim"
brew "nmap"
brew "node"
brew "nvm"
brew "onefetch"
brew "openshift-cli"
brew "openssh"
brew "pgcli"
brew "pigz"
brew "pinentry-mac"
brew "pngcheck"
brew "pv"
brew "qt"
brew "rename"
brew "rhino"
brew "sbt"
brew "screen"
brew "skaffold"
brew "source-to-image"
brew "speedtest-cli"
brew "sphinx-doc"
brew "sqlmap"
brew "swig"
brew "tcpflow"
brew "tcptrace"
brew "tee-clc"
brew "telnet"
brew "transmission-cli"
brew "tree"
brew "typescript"
brew "ucspi-tcp"
brew "watch"
brew "wget"
brew "xhyve", args: ["HEAD"]
brew "yarn"
brew "ykpers"
brew "ykman"
brew "youtube-dl"
brew "yq"
brew "aws/tap/aws-sam-cli"
brew "bramstein/fonttools/woff2"

cask "1password"
cask "aerial"
cask "airfoil"
cask "amazon-workspaces"
cask "arq"
cask "audio-hijack"
cask "beersmith2"
cask "bunqcommunity-bunq"
cask "cheatsheet"
cask "cleanmymac"
cask "cyberduck"
cask "daisydisk"
cask "devonthink-pro-office"
cask "docker"
cask "docker-toolbox"
cask "dotnet-sdk"
cask "dotnet-sdk3-1-400"
cask "dozer"
cask "duet"
cask "elgato-stream-deck"
cask "flutter"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono"
cask "franz"
cask "google-chrome"
cask "google-cloud-sdk"
cask "gpg-suite"
cask "hazel"
cask "istat-menus"
cask "iterm2"
cask "keka"
cask "little-snitch"
cask "microsoft-office"
cask "microsoft-teams"
cask "moneymoney"
cask "obs"
cask "obs-virtualcam"
cask "onedrive"
cask "osxfuse"
cask "parallels-desktop"
cask "postman"
cask "send-to-kindle"
cask "signal"
cask "slack"
cask "sonic-pi"
cask "soundflower"
cask "superduper"
cask "teamviewer"
cask "the-unarchiver"
cask "transmission"
cask "tunnelblick"
cask "veracrypt"
cask "virtualbox"
cask "wireshark"
cask "wkhtmltopdf"
cask "workflowy"
cask "xca"
cask "xquartz"
cask "zoom"
cask "zoomus"
mas "Disk Diet", id: 445512770
mas "DuckDuckGo Privacy Essentials", id: 1482920575
mas "Duplicates Cleaner", id: 1012324495
mas "HP Smart", id: 1474276998
mas "Microsoft To Do", id: 1274495053
mas "Motif", id: 1404636482
mas "Pages", id: 409201541
mas "ReadKit", id: 588726889
mas "Spark", id: 1176895641
mas "Things", id: 904280696
mas "ToothFairy", id: 1191449274
mas "WHITEWALL", id: 1286836110
mas "Xcode", id: 497799835
